{"cells":[{"cell_type":"code","execution_count":2,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":42243,"status":"ok","timestamp":1679343976553,"user":{"displayName":"Peter Jonathan Montalvo Garcia","userId":"04861838521543152786"},"user_tz":300},"id":"powmwaXcslvz","outputId":"c02749a7-4431-45b7-8ed6-eca597a20451"},"outputs":[],"source":["# !pip install neo4j\n","# !pip install py2neo"]},{"cell_type":"code","execution_count":3,"metadata":{"executionInfo":{"elapsed":330,"status":"ok","timestamp":1679344003060,"user":{"displayName":"Peter Jonathan Montalvo Garcia","userId":"04861838521543152786"},"user_tz":300},"id":"f3sPVn0vsn2f"},"outputs":[],"source":["# from neo4j import GraphDatabase\n","# GraphDatabase??"]},{"cell_type":"code","execution_count":40,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"elapsed":549,"status":"ok","timestamp":1679345534619,"user":{"displayName":"Peter Jonathan Montalvo Garcia","userId":"04861838521543152786"},"user_tz":300},"id":"oGD62jlJtInG","outputId":"e080ff14-83d8-4dac-d824-f93ce03dfef7"},"outputs":[],"source":["from neo4j import GraphDatabase\n","import pandas as pd\n","import json\n","\n","with open('config.json', 'r') as f:\n","    credentials = json.load(f)\n","\n","uri = credentials['uri']\n","user = credentials['user']\n","password = credentials['password']\n","driver = GraphDatabase.driver(uri, auth=(user, password))\n","session = driver.session()"]},{"cell_type":"code","execution_count":38,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["Peru has 73 ocurrencies of users with vomiting symptom\n","United States has 72 ocurrencies of users with vomiting symptom\n","Vietnam has 72 ocurrencies of users with fatigue symptom\n","Peru has 71 ocurrencies of users with fatigue symptom\n","Indonesia has 68 ocurrencies of users with fatigue symptom\n","Vietnam has 67 ocurrencies of users with vomiting symptom\n","Singapore has 65 ocurrencies of users with fatigue symptom\n","New Zealand has 65 ocurrencies of users with vomiting symptom\n","Spain has 64 ocurrencies of users with fatigue symptom\n","Sweden has 61 ocurrencies of users with fatigue symptom\n"]}],"source":["cypher_query = \"\"\"\n","    MATCH (u:User)-[r]-(s:Symptom)\n","    RETURN u.country, s.symptom, COUNT(r) AS ocurrency\n","    ORDER BY ocurrency DESC\n","    LIMIT 10\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        print(f\"{record['u.country']} has {record['ocurrency']} ocurrencies of users with {record['s.symptom']} symptom\")"]},{"attachments":{},"cell_type":"markdown","metadata":{},"source":["Transforming query result to dataframe"]},{"cell_type":"code","execution_count":39,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["(10, 3)\n"]},{"data":{"text/html":["<div>\n","<style scoped>\n","    .dataframe tbody tr th:only-of-type {\n","        vertical-align: middle;\n","    }\n","\n","    .dataframe tbody tr th {\n","        vertical-align: top;\n","    }\n","\n","    .dataframe thead th {\n","        text-align: right;\n","    }\n","</style>\n","<table border=\"1\" class=\"dataframe\">\n","  <thead>\n","    <tr style=\"text-align: right;\">\n","      <th></th>\n","      <th>u.country</th>\n","      <th>s.symptom</th>\n","      <th>ocurrency</th>\n","    </tr>\n","  </thead>\n","  <tbody>\n","    <tr>\n","      <th>0</th>\n","      <td>Peru</td>\n","      <td>vomiting</td>\n","      <td>73</td>\n","    </tr>\n","    <tr>\n","      <th>1</th>\n","      <td>United States</td>\n","      <td>vomiting</td>\n","      <td>72</td>\n","    </tr>\n","    <tr>\n","      <th>2</th>\n","      <td>Vietnam</td>\n","      <td>fatigue</td>\n","      <td>72</td>\n","    </tr>\n","    <tr>\n","      <th>3</th>\n","      <td>Peru</td>\n","      <td>fatigue</td>\n","      <td>71</td>\n","    </tr>\n","    <tr>\n","      <th>4</th>\n","      <td>Indonesia</td>\n","      <td>fatigue</td>\n","      <td>68</td>\n","    </tr>\n","  </tbody>\n","</table>\n","</div>"],"text/plain":["       u.country s.symptom  ocurrency\n","0           Peru  vomiting         73\n","1  United States  vomiting         72\n","2        Vietnam   fatigue         72\n","3           Peru   fatigue         71\n","4      Indonesia   fatigue         68"]},"execution_count":39,"metadata":{},"output_type":"execute_result"}],"source":["cypher_query = \"\"\"\n","    MATCH (u:User)-[r]-(s:Symptom)\n","    RETURN u.country, s.symptom, COUNT(r) AS ocurrency\n","    ORDER BY ocurrency DESC\n","    LIMIT 10\n","\"\"\"\n","\n","df = pd.DataFrame()\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    df = result.to_df()\n","\n","print(df.shape)\n","df.head()"]},{"cell_type":"code","execution_count":21,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["<Record u.country='Austria' d.disease='hepatitis b' ocurrency=11>\n","<Record u.country='United States' d.disease='acne' ocurrency=11>\n","<Record u.country='South Africa' d.disease='heart attack' ocurrency=9>\n","<Record u.country='Vietnam' d.disease='common cold' ocurrency=9>\n","<Record u.country='South Korea' d.disease='dengue' ocurrency=9>\n","<Record u.country='United States' d.disease='chronic cholestasis' ocurrency=9>\n","<Record u.country='Netherlands' d.disease='allergy' ocurrency=9>\n","<Record u.country='Belgium' d.disease='peptic ulcer diseae' ocurrency=9>\n","<Record u.country='Singapore' d.disease='jaundice' ocurrency=9>\n","<Record u.country='Italy' d.disease='hypothyroidism' ocurrency=8>\n"]}],"source":["cypher_query = \"\"\"\n","    MATCH (u:User)-[r]-(d:Disease)\n","    RETURN u.country, d.disease, COUNT(r) AS ocurrency\n","    ORDER BY ocurrency DESC\n","    LIMIT 10\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        print(record)"]},{"cell_type":"code","execution_count":17,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["<Record d.disease='acne' n_symp=4 severity=9.0 avg_severity=2.25>\n","<Record d.disease='psoriasis' n_symp=6 severity=15.0 avg_severity=2.5>\n","<Record d.disease='fungal infection' n_symp=3 severity=8.0 avg_severity=2.67>\n","<Record d.disease='osteoarthristis' n_symp=6 severity=20.0 avg_severity=3.33>\n","<Record d.disease='paralysis (brain hemorrhage)' n_symp=4 severity=14.0 avg_severity=3.5>\n","<Record d.disease='migraine' n_symp=9 severity=32.0 avg_severity=3.56>\n","<Record d.disease='hepatitis b' n_symp=12 severity=43.0 avg_severity=3.58>\n","<Record d.disease='arthritis' n_symp=5 severity=18.0 avg_severity=3.6>\n","<Record d.disease='chronic cholestasis' n_symp=7 severity=26.0 avg_severity=3.71>\n","<Record d.disease='drug reaction' n_symp=4 severity=15.0 avg_severity=3.75>\n"]}],"source":["cypher_query = \"\"\"\n","    MATCH (d:Disease)-[r]-(s:Symptom)\n","    WITH d, COUNT(s.symptom) AS n_symp, SUM(toFloat(s.weight)) AS severity\n","    RETURN d.disease, n_symp, severity, ROUND(severity/n_symp,2) AS avg_severity \n","    ORDER BY avg_severity ASC\n","    LIMIT 10\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        print(record)"]},{"cell_type":"code","execution_count":73,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["The disease named common cold is related with continuous sneezing by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with headache by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with throat irritation by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with high fever by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with loss of smell by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with redness of eyes by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with swelled lymph nodes by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with muscle pain by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with malaise by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with phlegm by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with sinus pressure by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with chest pain by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with fatigue by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with chills by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with congestion by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with runny nose by the relationship IS_PRESENTED_BY\n","The disease named common cold is related with cough by the relationship IS_PRESENTED_BY\n"]}],"source":["cypher_query = \"\"\"\n","    MATCH (d:Disease)-[r]-(s:Symptom)\n","    WITH d,r,s\n","    WHERE d.disease = 'common cold'\n","    RETURN *\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        disease = record['d'] \n","        relationship = record['r'] \n","        symptom = record['s'] \n","        print(f\"The disease named {disease['disease']} is related with {symptom['symptom']} by the relationship {relationship.type}\")"]},{"cell_type":"code","execution_count":68,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["symptom['symptom']='itching', <class 'str'>\n","symptom['weight']='1', <class 'str'>\n","symptom['symptom']='skin rash', <class 'str'>\n","symptom['weight']='3', <class 'str'>\n","symptom['symptom']='nodal skin eruptions', <class 'str'>\n","symptom['weight']='4', <class 'str'>\n","symptom['symptom']='continuous sneezing', <class 'str'>\n","symptom['weight']='4', <class 'str'>\n","symptom['symptom']='shivering', <class 'str'>\n","symptom['weight']='5', <class 'str'>\n","symptom['symptom']='chills', <class 'str'>\n","symptom['weight']='3', <class 'str'>\n","symptom['symptom']='joint pain', <class 'str'>\n","symptom['weight']='3', <class 'str'>\n","symptom['symptom']='stomach pain', <class 'str'>\n","symptom['weight']='5', <class 'str'>\n","symptom['symptom']='acidity', <class 'str'>\n","symptom['weight']='3', <class 'str'>\n","symptom['symptom']='ulcers on tongue', <class 'str'>\n","symptom['weight']='4', <class 'str'>\n"]}],"source":["cypher_query = \"\"\"\n","    MATCH (s:Symptom)\n","    RETURN *\n","    LIMIT 10\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        symptom = record['s'] \n","        print(f\"{symptom['symptom']=}, {type(symptom['symptom'])}\")\n","        print(f\"{symptom['weight']=}, {type(symptom['weight'])}\")"]},{"cell_type":"code","execution_count":74,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["<Record label='Disease'>\n","['label']\n","['Disease']\n","<Record label='Precaution'>\n","['label']\n","['Precaution']\n","<Record label='Symptom'>\n","['label']\n","['Symptom']\n","<Record label='User'>\n","['label']\n","['User']\n"]}],"source":["cypher_query = \"\"\"\n","    CALL db.labels()\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        print(record)\n","        print(record.keys())\n","        print(record.values())"]},{"cell_type":"code","execution_count":70,"metadata":{},"outputs":[{"name":"stdout","output_type":"stream","text":["<Record relationshipType='IS_SICK_WITH'>\n","<Record relationshipType='PRESENTS'>\n","<Record relationshipType='IS_TREATED_WITH'>\n","<Record relationshipType='IS_PRESENTED_BY'>\n"]}],"source":["cypher_query = \"\"\"\n","    CALL db.relationshipTypes()\n","\"\"\"\n","\n","# execute the query\n","with driver.session() as session:\n","    result = session.run(cypher_query)\n","    for record in result:\n","        print(record)"]}],"metadata":{"colab":{"authorship_tag":"ABX9TyMT+1YFrgg7SdxJ+q993elu","provenance":[]},"kernelspec":{"display_name":"Python 3","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.9"}},"nbformat":4,"nbformat_minor":0}
